
#include <stdio.h>
#include <stdlib.h>

int main(int argc, char* argv[])
{
    int n, i, j, k, t, a[1000][3];
    long long  time = 0, sum = 0;//定义前面同学总时长、打卡时间之和为双长型
    scanf("%d", &n);
    //输入每个同学的三个参数，并直接整理为发详细打卡前总时长和全部总时长两类分别放到第一列和第三列
    for (i = 0; i < n; i++)
    {
        scanf("%d %d %d", &a[i][0], &t, &a[i][1]);//输入前来时间、答题时间、离去时间【注意：离去时间保持在第二列】
        a[i][0] += t;//将第一列整理为对单个学生打卡前总时长
        a[i][2] = a[i][0] + a[i][1];//第三列整理为单个学生全部总时长
    }
    //选择排序法：选择全部总时间最短的同学放到最前面，然后向后对同学依次由小到大排序
    for (i = 0; i < n - 1; i++)//遍历第1至n-1个同学数据
    {
        k = i;//初始化全部总时长最少的同学位置（指向第一个同学）
        for (j = i+1; j < n; j++)//遍历第2至n个同学数据
        {
            if (a[j][2] < a[k][2]) k = j;//整个循环后k值始终指向全部总时长最少的同学
        }
        if (k != i)//如果k值指向的全部总时长最少的同学不是此次整体遍历第一个同学，将k值指向总时长最短的同学的位置与真题遍历第一个同学的位置互换
        {
            for (j = 0; j < 3; j++)
            {
                t = a[k][j];//t作为互换中间容器
                a[k][j] = a[i][j];
                a[i][j] = t;
            }
        }
    }
    //计算每个同学打卡时间之和
    for (i = 0; i < n; i++)
    {
        time += a[i][0];//前面学生全部总时长+当前学生打卡前总时长=获得当前学生打卡时间
        sum += time;//对所有打卡时刻逐一加和
        time += a[i][1];//当前学生打卡时刻+当前同学离去时间=累计目前所有学生总时长
    }
    printf("%lld", sum);//以双长型格式输出所有同学打卡时刻之和
    return 0;
}
